Benchmark_files/output_stand_alone_read_t4_2.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)
 
 Running the test with following options:
 Number of threads: 4
 Initializing random number generator from current time
 
 
 Initializing worker threads...
 
 Threads started!
 
 Latency histogram (values are in milliseconds)
        value  ------------- distribution ------------- count
        3.551 |                                         1
        3.816 |                                         2
        3.956 |                                         1
        4.028 |                                         1
        4.487 |                                         1
        5.183 |                                         1
        5.373 |                                         1
        5.774 |                                         1
        5.986 |                                         3
        6.095 |                                         1
        6.318 |                                         5
        6.433 |*                                        23
        6.550 |****                                     110
        6.669 |************                             325
        6.790 |******************************           821
        6.913 |**************************************** 1080
        7.039 |***************************************  1048
        7.167 |***********************                  630
        7.297 |*************                            345
        7.430 |*******                                  190
        7.565 |****                                     118
        7.702 |**                                       59
        7.842 |*                                        25
        7.985 |*                                        18
        8.130 |*                                        22
        8.277 |*                                        14
        8.428 |*                                        24
        8.581 |                                         8
        8.737 |                                         11
        8.895 |                                         9
        9.057 |                                         11
        9.222 |                                         3
        9.389 |                                         5
        9.560 |                                         1
        9.734 |                                         5
        9.910 |                                         4
       10.090 |                                         2
       10.274 |                                         4
       10.460 |                                         2
       10.844 |                                         4
       11.041 |                                         2
       11.242 |                                         6
       11.446 |                                         3
       11.654 |                                         5
       11.866 |                                         7
       12.081 |                                         4
       12.301 |                                         11
       12.524 |                                         5
       12.752 |*                                        14
       12.984 |                                         10
       13.219 |                                         10
       13.460 |                                         4
       13.704 |                                         2
       13.953 |                                         1
       14.207 |                                         5
       14.465 |                                         13
       14.728 |                                         5
       14.995 |                                         5
       15.268 |                                         11
       15.545 |                                         7
       15.828 |                                         11
       16.115 |                                         7
       16.408 |                                         1
       16.706 |                                         8
       17.010 |                                         9
       17.319 |                                         7
       17.633 |                                         6
       17.954 |                                         4
       18.280 |                                         4
       18.612 |                                         3
       18.950 |                                         5
       19.295 |                                         5
       19.645 |                                         8
       20.002 |                                         6
       20.366 |                                         9
       20.736 |                                         5
       21.112 |                                         2
       21.496 |                                         4
       21.886 |                                         3
       22.284 |                                         3
       22.689 |                                         2
       23.101 |                                         5
       23.521 |                                         2
       23.948 |                                         4
       24.384 |                                         2
       24.827 |                                         3
       25.278 |                                         1
       25.737 |                                         4
       26.205 |                                         4
       26.681 |                                         1
       27.165 |                                         1
       28.162 |                                         3
       29.194 |                                         1
       29.725 |                                         3
       30.265 |                                         1
       31.945 |                                         1
       34.954 |                                         1
       36.894 |                                         1
       41.851 |                                         2
       42.611 |                                         1
       44.173 |                                         1
       47.472 |                                         1
       49.213 |                                         1
       50.107 |                                         1
       53.850 |                                         1
  
 SQL statistics:
     queries performed:
         read:                            73178
         write:                           0
         other:                           10454
         total:                           83632
     transactions:                        5227   (522.10 per sec.)
     queries:                             83632  (8353.63 per sec.)
     ignored errors:                      0      (0.00 per sec.)
     reconnects:                          0      (0.00 per sec.)
 
 General statistics:
     total time:                          10.0096s
     total number of events:              5227
 
 Latency (ms):
          min:                                    3.55
          avg:                                    7.65
          max:                                   53.58
          95th percentile:                       12.08
          sum:                                40005.31
 
 Threads fairness:
     events (avg/stddev):           1306.7500/7.66
     execution time (avg/stddev):   10.0013/0.00